import { APIURL } from "@/data/consts";
import { ProjectPrediction } from "@/interfaces/projectPrediction";
import { postFetch, updateFetch } from "@/lib/fetch";
import { toast } from "sonner";


const mock: ProjectPrediction ={
  "reasoning": "با توجه به شباهت بالای پروژه جدید به پروژه‌های «توسعه وب‌اپ پزشکی» و «پلتفرم مشاوره آنلاین» که دارای امکانات مشابهی نظیر پنل بیمار و پزشک، نوبت‌دهی، سوابق پزشکی و درگاه پرداخت هستند، بازه قیمت دلاری ۱۶۷ تا ۵۳۵ دلار تخمین زده شد. با در نظر گرفتن پیچیدگی اضافه پروژه مبدأ در بخش آپلود مدارک و نسخه، میانگین وزنی این بازه حدود ۳۸۰ دلار در نظر گرفته شد که با ضرب در نرخ ۱۸۸۶۰۰ تومان، قیمت نقطه‌ای نهایی به دست آمد.",
  "estimated_price": 71668000,
  "similar_projects": [
    {
      "id": "61c5ef77-549f-439a-81f7-a1e29f443868",
      "title": "پروژه رزرواسیون",
      "date": "2025-05-07 17:10:32",
      "description": "ما به‌دنبال طراحی و پیاده‌سازی یک سامانه آنلاین جامع برای مدیریت رزرو و اجاره ویلا هستیم. این سیستم باید امکان جستجوی ویلا با فیلترهای دقیق (تعداد نفرات، موقعیت مکانی، امکانات رفاهی، قیمت، نوع اقامتگاه و...) را در اختیار کاربر قرار دهد و فرایند رزرو به‌صورت مرحله‌به‌مرحله، با امکان پرداخت بیعانه، تایمر رزرو، ارسال پیامک اطلاع‌رسانی، نمایش قرارداد PDF و پیگیری‌های خودکار قبل و بعد از اقامت انجام شود. همچنین قابلیت اتصال به درگاه پرداخت، ذخیره اطلاعات کاربر و ارسال پیامک حاوی اطلاعات ویلا، لوکیشن و قرارداد از الزامات است.\n\nاز طرف دیگر، سیستم باید دارای پنل مدیریت برای مشاوران، اپراتورها و صاحبان ویلا باشد تا بتوانند اطلاعات رزروها، فایل‌های مربوط به هر ویلا، تقویم اجاره، قراردادها، مشتریان و گزارش‌های مالی را مدیریت کنند. همچنین نیاز است امکان نمایش ویلاها روی نقشه، انتقال مشتریان بین اپراتورها، تعیین کمیسیون، ثبت قوانین خاص هر ویلا و دریافت بازخورد مشتری پس از اقامت در نظر گرفته شود. طراحی به‌صورت ماژولار، توسعه‌پذیر و با رابط کاربری روان از اولویت‌هاست.",
      "timeline_days": 50,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 17000000,
      "max_budget": 33500000,
      "converted_min_budget_tomans": 38723391.406745374,
      "converted_max_budget_tomans": 76307859.53682177,
      "project_link": "https://ponisha.ir/project/602902"
    },
    {
      "id": "e89d4f1e-3e03-40e0-9469-f45e768230ab",
      "title": "توسعه وب‌اپ پزشکی، پنل پزشک و بیمار،نوبت‌دهی و مشاوره آنلاین",
      "date": "2025-08-30 16:06:06",
      "description": "ما قصد داریم یک پلتفرم پزشکی آنلاین (وب‌اپلیکیشن) طراحی کنیم که در فاز اول امکانات زیر را داشته باشد:\n\t1.\tثبت‌نام و احراز هویت پزشکان (با مدارک پزشکی)\n\t2.\tپروفایل پزشک شامل: تخصص، سوابق، مقالات، ساعات حضور\n\t3.\tپنل بیمار شامل: ثبت‌نام، پروفایل شخصی، مشاهده پزشکان، گرفتن نوبت\n\t4.\tسیستم نوبت‌دهی آنلاین (زمان‌بندی ساده و قابل توسعه در آینده)\n\t5.\tمشاوره آنلاین درون پلتفرم (ارسال متن، ویس و مدارک توسط بیمار برای پزشک)\n\t6.\tداشبورد ادمین برای مدیریت پزشکان، بیماران، تراکنش‌ها و محتوا\n\t7.\tزیرساخت پرداخت آنلاین ریالی (درگاه زرین‌پال یا مشابه",
      "timeline_days": 43,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 17000000,
      "max_budget": 33500000,
      "converted_min_budget_tomans": 31620888.60397456,
      "converted_max_budget_tomans": 62311751.07253809,
      "project_link": "https://ponisha.ir/project/649836"
    },
    {
      "id": "cb6ae779-af09-4ef2-81cf-8873c933d1ac",
      "title": "اپلیکیشن نوبت‌دهی مطب با ‏Flutter",
      "date": "2026-02-12 08:40:37",
      "description": "۱. امکانات و ماژول‌های مورد انتظار\nالف) بخش بیماران\nثبت‌نام و احراز هویت: ورود از طریق شماره تلفن، ایمیل یا حساب‌های کاربری Google و Apple\nجستجوی پزشکان: فیلتر بر اساس تخصص، موقعیت جغرافیایی، جنسیت و امتیاز کاربران\nپروفایل پزشک: نمایش اطلاعات کامل شامل ساعات کاری، آدرس، تعرفه‌ها و نظرات بیماران\nسیستم نوبت‌دهی هوشمند: انتخاب تاریخ و ساعت، تأیید نوبت و پرداخت آنلاین (در صورت نیاز)\nمدیریت نوبت‌ها: مشاهده سوابق، لغو نوبت و دریافت یادآوری از طریق Push Notification\nاطلاعات پزشکی (اختیاری): ثبت خلاصه‌ای از سوابق پزشکی بیمار\nب) بخش پزشکان / مطب‌ها\nپنل مدیریتی پزشک: مشاهده نوبت‌های روزانه، مدیریت ساعات کاری و ویرایش اطلاعات مطب\nیادآوری خودکار: ارسال اعلان به بیماران برای نوبت‌های نزدیک\nسیستم اطلاع‌رسانی: ارسال پیام‌های عمومی به بیماران (مانند تعطیلی یا تغییر ساعات مطب)\nج) بخش عمومی و مدیریتی\nپنل ادمین: مدیریت کاربران، پزشکان و گزارش‌گیری کلی\nپرداخت آنلاین: اتصال به درگاه‌های پرداخت ایرانی (مانند زرین‌پال، IDPay و …)\nنقشه و مکان‌یابی: نمایش موقعیت مطب‌ها روی نقشه با استفاده از Google Maps\n۲. پیشنهادات فنی و تکنولوژی‌های مورد انتظار\nفریم‌ورک: Flutter (ترجیحاً آخرین نسخه Stable)\nزبان برنامه‌نویسی: Dart\nمدیریت وضعیت (State Management): Provider یا Bloc (بر اساس تجربه توسعه‌دهنده)\nذخیره‌سازی و بک‌اند: Firebase یا بک‌اند اختصاصی با Laravel / Django\nنوتیفیکیشن: Firebase Cloud Messaging (FCM)\nنقشه: Google Maps API\nپرداخت: یکپارچه‌سازی با درگاه‌های پرداخت داخلی\n۳. الزامات کیفی و امنیتی\nطراحی UI/UX جذاب و واکنش‌گرا مطابق با اصول Material Design\nامنیت اطلاعات: استفاده از HTTPS، رمزنگاری داده‌های حساس و مدیریت صحیح session‌ها\nکارایی بالا: کاهش زمان بارگذاری و بهینه‌سازی تصاویر\nسازگاری کامل با نسخه‌های مختلف Android و iOS\n۴. مواردی که انتظار می‌رود در پیشنهاد فریلنسر ارائه شود\nسوابق کاری: معرفی نمونه اپلیکیشن‌های مشابه توسعه‌یافته با Flutter\nرویکرد فنی: توضیح معماری پیشنهادی (State Management، بک‌اند و دیتابیس)\nزمان‌بندی: تخمین زمان تحویل نسخه MVP و نسخه نهایی\nهزینه: برآورد هزینه به‌صورت ساعتی یا پروژه‌ای\nپیشنهادات تکمیلی: قابلیت‌های قابل‌افزوده مانند ویدئو کال، چت آنلاین پزشک و بیمار و …\n۵. مراحل اجرای پروژه\nتحلیل و طراحی: ارائه Wireframe و مستندات فنی\nتوسعه نسخه MVP: پیاده‌سازی قابلیت‌های اصلی\nتست و رفع اشکال: بهینه‌سازی و Debug\nتحویل نسخه نهایی: انتشار در App Store و Google Play (در صورت توافق)\nپشتیبانی اولیه: به‌مدت یک ماه پس از تحویل پروژه",
      "timeline_days": 30,
      "actual_price_tomans": 200000,
      "converted_price_tomans": 232299.98229420866,
      "min_budget": 150000,
      "max_budget": 220000,
      "converted_min_budget_tomans": 174224.98672065648,
      "converted_max_budget_tomans": 255529.98052362952,
      "project_link": "https://www.karlancer.com/projects/اپلیکیشن-نوبتدهی-مطب-flutter-w9637o04r6n3"
    },
    {
      "id": "31ec0d37-07ab-4562-b4b2-c87091961616",
      "title": "طراحی و توسعه پلتفرم مشاوره آنلاین",
      "date": "2026-05-03 21:26:19",
      "description": "عنوان سفارش\n\nطراحی و توسعه پلتفرم مشاوره آنلاین \n\n\nهدف کلی پروژه\n\nطراحی و پیاده‌سازی یک پلتفرم جامع آنلاین مشاوره که متخصصان بتوانند خدمات خود را به صورت تلفنی، متنی و ویدیویی به مراجعان ارائه دهند.\n\nقابلیت‌های اجباری \n۱. بخش مشتری (مراجع)\n• جستجوی پیشرفته متخصص بر اساس تخصص، شهر، جنسیت، قیمت\n• مشاهده پروفایل متخصص (بیوگرافی، نظرات، رزومه، هزینه)\n• رزرو وقت مشاوره (تلفنی، متنی، ویدیویی)\n• پرداخت آنلاین (زرین‌پال یا زرین‌کارت)\n• پنل کاربری: تاریخچه جلسات، فاکتورها، پیگیری وضعیت\n\n۲. بخش متخصص (روانشناس)\n• ثبت‌نام و ایجاد پروفایل حرفه‌ای\n• تعیین تعرفه، تخصص‌ها، زمان‌های آزاد\n• تقویم مدیریت جلسات\n• دریافت اعلان هنگام رزرو جدید\n• ارتباط با مشتری (چت متنی / تماس داخلی)\n\n۳. بخش ادمین\n• تأیید مدارک توسط ادمین (احراز هویت)\n• مدیریت کاربران، جلسات، تراکنش‌ها\n• گزارش‌گیری (درآمد، تعداد جلسات، امتیازها)\n• مدیریت محتوای وبلاگ و صفحات ثابت\n\n۴. قابلیت‌های فنی دقیق0\n• معماری SPA یا SSR (مثل Vue.js + Laravel)\n• قابلیت PWA (افزودن به صفحه اصلی موبایل)\n• چت آنلاین لحظه‌ای (با WebSocket)\n• API اختصاصی برای اپلیکیشن موبایل (در آینده)\n• امنیت: CSRF، XSS‑safe، رمزنگاری رمزها\n• سئو داخلی (ساختار لینک‌ها، متا تگ‌ها)\n• گزارش خطا با ابزاری مثل Sentry\n• سازگاری با iOS / Android (Safe Area, Viewport)\n\nخروجی تحویلی مورد انتظار\n1 کد کامل پروژه (با مستندات نصب و راه‌اندازی)\n2. دیتابیس + فایل تنظیمات اولیه\n3. پنل مدیریت کامل\n4. اپلیکیشن PWA (قابل نصب روی موبایل)\n\nتکنولوژی‌های ترجیحی (اختیاری، پیشنهاد شما هم آزاد)\n• بک‌اند: PHP (Laravel 10 یا 11)\n• فرانت‌اند: Vue.js 3 (یا React)\n• دیتابیس: MySQL / MariaDB\n• وب سرور: Nginx / Apache\n• پرداخت: زرین‌پال / زرین‌کارت\n• چت: WebSocket + Pusher یا Laravel Reverb\nسطح مهارت فنی مورد نیاز\n معماری لاراول (Eloquent، Middleware، Queue، Event)\n• Vue.js (کامپوننت‌های SPA، Vuex/Pinia)\n• امنیت و عملکرد (Indexing، Cache، CSRF)\n• تجربه پیاده‌سازی PWA و WebSocket\n\nدر نهایت\n1. نمونه کار مشابه (لینک سایت پلتفرم مشابه) بدید لطفا\n2. تکنولوژی دقیقی که استفاده می‌کنید (نسخه فریمورک‌ها)\n3. برنامه زمان‌بندی مراحل تحویل (با Milestone)\n4. هزینه تفکیک‌شده (طراحی، برنامه‌نویسی، داکیومنت، پشتیبانی ۳ ماهه)\n5. آیا تیم هستید یا شخص؟",
      "timeline_days": 54,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 67000000,
      "max_budget": 100000000,
      "converted_min_budget_tomans": 67651948.12147819,
      "converted_max_budget_tomans": 100973056.89772865,
      "project_link": "https://ponisha.ir/project/723563"
    },
    {
      "id": "303cb1c6-faf4-4171-bd4d-2cc0bcfca015",
      "title": "طراحی فول استک وب سایت فروش دوره آموزشی از صفر",
      "date": "2025-12-27 12:28:40",
      "description": "فلو ها و فانکشنالیتی ها های سایت انجام شده. موارد زیر نیاز به انجام دارن: \n-- طراحی و پیاده سازی فرانت\n-- طراحی و پیاده سازی بک اند\n-- ساپورت ماهانه وب سرور\n\nفانکشنالیتی های سایت:\n-- فرم ثبت نام برای معلم ها\n-- جستجو و دسته بندی معلم ها\n-- صفحه شخصی هر معلم برای رزرو (به همراه تقویم و توضیحات که توسط خود معلم پر میشه و به کاربر نشون داده میشه شامل متن و ویدیو) = دشبورد معلم\n-- دشبورد دانش آموز\n-- دشبورد معلم\n-- چت آنلاین + مدیریت تیکت\n-- پیمنت بین المللی (ویزا و پیپل)\n-- پنل ادمین\n-- کامنت گذاری و ریتینگ\n\nپی. اس: معماری ماجولار که ادمین سایت بتونه بعداَ:\n-- دسته بندی آموزشی اضافه کنه\n-- ریپورت های ساده (مثل اینکه امروز چه کلاس هایی قرار برگزار بشه و ...)",
      "timeline_days": 36,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 34000000,
      "max_budget": 67000000,
      "converted_min_budget_tomans": 46933879.83641504,
      "converted_max_budget_tomans": 92487351.44234729,
      "project_link": "https://ponisha.ir/project/700690"
    },
    {
      "id": "e46c7f20-bc3d-4195-bcae-80272ace978b",
      "title": "طراحی CRM پزشکی",
      "date": "2026-05-09 16:24:04",
      "description": "ما در حال راه‌اندازی یک پروژه CRM پزشکی هستیم و به دنبال همکاری با فرد یا تیمی توانمند در حوزه طراحی رابط کاربری و برنامه‌نویسی هستیم تا این سامانه را به‌صورت حرفه‌ای، کاربردی و مقیاس‌پذیر پیاده‌سازی کند.\n\nهدف این پروژه، طراحی و توسعه یک سیستم مدیریت ارتباط با مشتری ویژه حوزه پزشکی است که بتواند فرآیندهای مربوط به مدیریت بیماران، نوبت‌دهی، پیگیری مراجعات، ثبت اطلاعات، ارتباط با مراجعین، گزارش‌گیری و مدیریت فرآیندهای داخلی را به شکلی منظم و هوشمند پوشش دهد.\n\nخدمات مورد نیاز در این پروژه:\nتحلیل نیازمندی‌ها و ارائه ساختار مناسب سیستم\nطراحی UI/UX با رویکرد ساده، حرفه‌ای و کاربرپسند\nتوسعه فرانت‌اند و بک‌اند\nطراحی دیتابیس و معماری فنی مناسب\nپیاده‌سازی پنل مدیریت و دسترسی‌های مختلف کاربران\nاتصال ماژول‌های مورد نیاز مانند پیامک، نوبت‌دهی، گزارش‌گیری و ثبت سوابق\nقابلیت توسعه‌پذیری و نگهداری آسان سیستم\nویژگی‌های مدنظر:\nتجربه کاربری روان و مناسب برای کاربران حوزه درمان\nامنیت مناسب برای نگهداری اطلاعات\nکدنویسی تمیز و ساختارمند\nمستندسازی مناسب\nتحویل مرحله‌ای و امکان توسعه در فازهای بعدی\nاز همکار مورد نظر انتظار داریم:\nسابقه طراحی و توسعه پروژه‌های تحت وب یا CRM\nتسلط کافی بر طراحی رابط کاربری و پیاده‌سازی فنی\nتوانایی ارائه پیشنهاد فنی و راهکارهای بهینه\nمسئولیت‌پذیری، نظم در اجرا و تعهد به زمان‌بندی\nاگر تجربه کار روی سامانه‌های پزشکی، کلینیکی، نوبت‌دهی یا CRM را دارید، لطفاً در رزومه یا پیشنهاد خود حتماً نمونه‌کارهای مرتبط را ارسال کنید.",
      "timeline_days": 54,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 34000000,
      "max_budget": 67000000,
      "converted_min_budget_tomans": 36020165.990254045,
      "converted_max_budget_tomans": 70980915.3337359,
      "project_link": "https://ponisha.ir/project/725147"
    },
    {
      "id": "f78b5158-4160-4ddc-b8ab-3e5ada6cded7",
      "title": "طراحی یک وبسایت تله مدیسن یا پزشکی از راه دور",
      "date": "2026-05-02 18:11:57",
      "description": "درخواست طراحی یک وبسایت تله مدیسن یا ویزیت انلاین داریم به صورتی که قابلیت نمایش پزشکان ویزیت بیماران به صورت متنی یا تصویری ارائه نسخه به بیماران و امکان ساخت پرونده پزشکی برای بیماران وجود داشته باشد همچنین بخش بلاگ و فروش محصول نیز در سایت وجود داشته باشد برای نمونه می توانید به وبسایت دکتر ساینا مراجعه کنید",
      "timeline_days": 37,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 4000000,
      "max_budget": 9000000,
      "converted_min_budget_tomans": 4144485.6475758823,
      "converted_max_budget_tomans": 9325092.707045736,
      "project_link": "https://ponisha.ir/project/723173"
    },
    {
      "id": "e7d7b034-1eb2-4984-89ad-19a00a57c904",
      "title": "طراحی و پیاده‌سازی نرم‌افزار جامع مدیریت کلینیک دامپزشکی",
      "date": "2025-12-22 12:17:35",
      "description": "ما در نظر داریم یک نرم‌افزار جامع، تحت وب و ماژولار برای مدیریت کلینیک‌های دامپزشکی طراحی و پیاده‌سازی کنیم.\nاین نرم‌افزار باید فرآیندهای نوبت‌دهی آنلاین، پذیرش، مدیریت صف، پرونده پزشکی، ارتباط با مشتری و عملیات مالی را به‌صورت یکپارچه پوشش دهد.\nهدف اصلی پروژه:\n•\tکاهش فشار عملیاتی پذیرش\n•\tاستفاده بهینه از ظرفیت پزشکان\n•\tکاهش نرخ عدم حضور (No-show)\n•\tبهبود تجربه صاحبان حیوانات خانگی\n•\tفراهم‌سازی داده‌های مدیریتی برای تصمیم‌گیری\nاین سیستم باید قابل استفاده برای کلینیک‌های تک‌شعبه و چندشعبه بوده و امکان توسعه به SaaS در آینده را داشته باشد.\n*********فایل RFP کامل حتما مطالعه شود************",
      "timeline_days": 84,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 100000000,
      "max_budget": 0,
      "converted_min_budget_tomans": 143181149.58672196,
      "converted_max_budget_tomans": 0,
      "project_link": "https://ponisha.ir/project/698557"
    },
    {
      "id": "aff1f854-abc5-4b5c-8b34-1ae543fe4701",
      "title": "طراحی یک سایت رزرواسیون مشابه جاجیگا",
      "date": "2025-06-27 13:47:19",
      "description": "با سلام و احترام،\n\nما به دنبال طراحی و برنامه نویسی یک وب‌سایت حرفه‌ای و اختصاصی هستیم که کاملاً بر اساس نیازهای خاص ما ایجاد گردد و از سیستم‌های آماده‌ای مانند وردپرس استفاده نشود . وب‌سایت مورد نظر ما باید امکانات و ظاهری مشابه وب‌سایت jajiga.com داشته باشد. \n\nامکانات مورد نیاز شامل:\n\n    صفحه نخست\n    فیلتر جستجو\n    سیستم رزرواسیون\n    صفحه ملک\n    سیستم علاقه‌مندی‌ها\n    ثبت‌نام و ورود کاربران\n    احراز هویت میزبان\n    ارسال آگهی توسط میزبان\n    سوابق رزرو و پرداخت میزبان\n    چت پیشرفته و امکانات رزرو میهمان\n    سیستم تخفیف‌دهی\n    امکان نظر دهی و امتیازدهی به ملک و میزبان\n    سیستم دعوت از دوستان\n    چت تیکت مدیریت\n    اتصال به پنل SMS\n    تمامی امکانات دیگر مشابه آنچه در سایت جاجیگا است.\n\nلطفاً توجه داشته باشید که برخی تغییرات ظاهری برای متمایز شدن از سایت ذکر شده نیز نیاز است. جزئیات هر یک از بخش‌ها را می‌توانید از سایت یادشده مشاهده نمایید و همچنین می‌توانم به تفکیک هر بخش را برای شما توضیح دهم.\n\nنیازمندی‌های فنی:\n\n    کدنویسی باید به صورت SEO-friendly و با سرعت بالا انجام شود.\n    کیفیت بالای کدنویسی در اولویت است و زبان کدنویسی مورد نظر باید با زبان کدنویسی استفاده شده در وب‌سایت مشابه هم‌خوانی داشته باشد یا بهتر باشد.\n    ارائه کامل سورس کد به همراه تمامی قابلیت‌ها الزامی است.\n    تحویل ناقص پروژه (بدون یکی از بخش‌های ذکر شده) باعث می‌شود که پروژه ناقص تلقی شود و هزینه‌های پرداختی + خسارت بایستی عودت داده شود.\n    زبان های استفاده شده در سایت جاجیگا nod.js میباشد که میبایست با همین زبان ها نوشته شود . \n\n\nخلاصه شرح و شایستگی‌های مورد نیاز:\nما به یک شخص یا تیم متعهد، منظم و حرفه‌ای نیاز داریم که قادر باشد پروژه را دقیقا مشابه سایت جاجیگا به ما تحویل دهد و به صورت هفتگی گزارش دهد و پیشرفت کار را نمایش دهد.\n\nاز شما فریلنسرهای محترم دعوت می‌کنیم که در صورت تمایل به همکاری در این پروژه، پیشنهادات و نمونه کارهای قبلی خود را ارسال نمایید.\n\nنکته خیلی مهم : تا بحال به دو شخص این پروژه داده شده که نتوانستند از پس ان بر بیایند . این پروژه بی نهایت است . انجام این پروژه نیازمند قرار داد و مستلزم وجه التزام برای خسارت در صورت عدم توان در تحویل میباشد . \n\nبا تشکر از توجه شما",
      "timeline_days": 120,
      "actual_price_tomans": 40000000,
      "converted_price_tomans": 89697402.05695261,
      "min_budget": 25000000,
      "max_budget": 50000000,
      "converted_min_budget_tomans": 56060876.28559539,
      "converted_max_budget_tomans": 112121752.57119077,
      "project_link": "https://ponisha.ir/project/620145"
    },
    {
      "id": "7dfa5f9c-16c9-4a68-8345-a27dd600b494",
      "title": "طراحی سایت رزرواسیون و ویزیت بیماران",
      "date": "2022-01-24 11:29:24",
      "description": "<p>سلام</p><p>وقت بخیر</p><p><br />این پروژه قصد دارد روانشناسان برای انجام ویزیت بیماران را برنامه ریزی کند. به این صورت که توسط ادمین اصلی، یا توسط بخش ثبت نام روانشناس، پزشکان به پروژه اضافه می شوند. توسط بخش تقویم کاری می توانند زمان های حضور و رزرو اینترنتی خود را برای بیماران مشخص کنند. همچنین تخصص های خود را در زمینه های مختلف روانشناسی مشخص می کنند (برای فیلتر کردن بیماران). پس از مشخص کردن کامل اطلاعات روانپزشک وی برای پذیرش بیماران اینترنتی آماده است. بعد از رزرو هر بیمار می بایست زمان رزرو و اطلاعات بیمار به روانپزشک گوشزد شود. سیستم می بایست یک ریمایندر اتوماتیک داشته باشد تا به روانپزشک و بیمار اعلام جلسه را یادآوری نماید (ترجیحا پیامکی). روانشناس باید بتواند در بستر خود وبسایت و با استفاده از API سایت های ارائه دهنده خدمات چت ویدیویی آنلاین با بیمار خود در ارتباط باشند.\n</p><p>از نگاه یک بیمار، پس از ورود و مشاهده بخش ظاهری پرتال، برای اینکه بتواند با روانشناس یا روانپزشکی جلسه برگزار کند می بایست در بخش پرتال ثبت نام نماید. ثبت نام وی به همراه سوالاتی است که می بایست به آن جواب دهد تا بهترین گزینه (روانشناس) برای وی انتخاب گردد. این شکل از پرسش سوالات بهتر است توسط ظاهری مثل چت آنلاین با وی انجام پذیرد.\n</p><p>ادمین اصلی نیز باید بتواند کلیه مراحل را مدیریت کند و دسترسی به ویرایش کلیه بخش ها داشته باشد.\n</p><p>سایتی که از آن برای انجام این پروژه الهام گرفته شده است https://myonlinetherapy.com می باشد. بخش ظاهری سایت توسط وردپرس ایجاد شده و ما فقط بخش سامانه رزرو و بررسی را نیاز داریم.</p><p>در فایل پیوست ماژول های پیش فرض قرار داده شده است. لازم به ذکر است این پروژه نیاز به ارتقا و توسعه دارد و فردی که پروژه را می پذیرد می بایست بتواند پشتیبانی مناسب و همچنین (با برآورد جداگانه) کار توسعه را انجام دهد.</p>",
      "timeline_days": 0,
      "actual_price_tomans": 11000000,
      "converted_price_tomans": 74618517.95236082,
      "min_budget": 100000,
      "max_budget": 500000,
      "converted_min_budget_tomans": 678350.1632032803,
      "converted_max_budget_tomans": 3391750.8160164016,
      "project_link": "https://ponisha.ir/project/222909"
    }
  ],
  "suggested_settings": {
    "features": [
      "Authentication",
      "User Management",
      "User Profiles",
      "Administration Panel",
      "Dashboard",
      "Search",
      "Filtering & Sorting",
      "File Upload & Storage",
      "Notifications",
      "Messaging & Chat",
      "Payment Processing",
      "Booking & Reservation",
      "Scheduling & Calendar"
    ],
    "boolean_modifiers": [
      "web"
    ],
    "application_types": [
      "web_application",
      "booking_system",
      "healthcare_system"
    ],
    "technology_modifiers": [],
    "enum_modifiers": {
      "project_type": "new",
      "ai_level": "none",
      "business_logic": "medium",
      "data_volume": "medium",
      "integration_complexity": "low",
      "ui_complexity": "medium",
      "algorithmic_complexity": "low"
    },
    "numeric_modifiers": {
      "external_api_count": 1,
      "estimated_screens": 15,
      "estimated_entities": 8
    }
  }
}

export async function ProcessDescMixed(prompt: string) : Promise<ProjectPrediction> {

    // return mock;

    const result = await postFetch(
        APIURL + "mixed",
        JSON.stringify({
            "query": prompt
        })
    );



    const jsonResult = await result.json();

    if (result.ok) {
        toast.success("نتایج شما آماده است", {
        });
        return jsonResult;
    } else {
        // Handle different error status codes
        switch (result.status) {
            case 400:
                toast.error("خطای درخواست", {
                    description:
                        jsonResult.message || "مقدار ورودی نامعتبر است.",
                });
                break;
            case 401:
                toast.error("عدم احراز هویت", {
                    description: "مقدار ورودی اشتباه است.",
                });
                break;
            case 403:
                toast.error("مقدار ورودی اشتباه است", {
                    description: "لطفاً اطلاعات ورودی خود را بررسی کنید",
                });
                break;

            case 404:
                toast.error("api یافت نشد", {
                    description: "apiی با این مشخصات وجود ندارد.",
                });
                break;
            case 409:
                toast.error("حساب قفل شده", {
                    description: "حساب شما به دلیل تلاش‌های ناموفق متعدد قفل شده است.",
                });
                break;
            case 500:
                toast.error("خطای سرور", {
                    description: "خطایی در سرور رخ داده است. لطفاً بعداً تلاش کنید.",
                });
                break;
            default:
                toast.error("خطای ناشناخته", {
                    description:
                        jsonResult.error || "خطای نامشخصی در هنگام ورود رخ داده است.",
                });
        }
        throw new Error(jsonResult.error || "خطای نامشخص");
    }
}
