import { APIURL } from "@/data/consts";
import { ProjectPrediction } from "@/interfaces/projectPrediction";
import { postFetch, updateFetch } from "@/lib/fetch";
import { toast } from "sonner";


const mock: ProjectPrediction ={
  "reasoning": "با توجه به نیاز پروژه به توسعه اختصاصی (لاراول/React)، داشتن پنل‌های مجزا، سیستم نوبت‌دهی، آپلود سوابق پزشکی و مشاوره آنلاین، این پروژه شباهت زیادی به پروژه «توسعه وب‌اپ پزشکی، پنل پزشک و بیمار» و «پلتفرم آنلاین نوبت دهی حوزه سلامت» دارد. با در نظر گرفتن پیچیدگی منطق‌های کسب‌وکار و زمان حدود ۴۰ تا ۵۰ روز، میانگین بازه دلاری این پروژه‌های مشابه حدود ۲۵۰ دلار تخمین زده شد که با نرخ ۱۸۸۶۰۰ تومان به حدود ۴۷ میلیون تومان می‌رسد.",
  "estimated_price": 47150000,
  "similar_projects": [
    {
      "id": "8d009d36-31b8-413e-bd7b-6beb54d205c5",
      "title": "اپ ثبت نام و اخذ نوبت پزشکی با قابلیت AI",
      "date": "2025-08-23 02:17:35",
      "description": "عنوان: اپ ثبت نام و اخذ نوبت پزشکی با قابلیت AI\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: طراحی رابط کاربری (UI), هوش مصنوعی (AI)\nمدت زمان پروژه: 26.0\nتوضیحات: عنوان پروژه:\nساخت پلتفرم نوبت‌دهی و مشاوره آنلاین پزشکی با استفاده از Bubble (بدون کد)\n\nتوضیحات پروژه:\nما به دنبال یک فریلنسر متخصص در پلتفرم Bubble.io هستیم تا یک وب‌اپلیکیشن جامع برای مشاوره آنلاین پزشکی طراحی و پیاده‌سازی کند. این پروژه یک راه‌حل جامع برای ارتباط بین پزشکان و بیماران است که شامل پنل کاربری برای هر دو گروه می‌شود.\n\nهدف اصلی ما ساخت یک پلتفرم با کمترین نیاز به کدنویسی (No-Code) است تا سرعت توسعه بالا و هزینه‌های نگهداری پایین باشد.\n\nقابلیت‌های مورد انتظار:\nسیستم نوبت‌دهی و ثبت‌نام بیمار:\n\nبیمار از طریق لینک اختصاصی پلتفرم ثبت‌نام می‌کند و احراز هویت ترجیحاً از طریق پیامک انجام می‌شود.\n\nپس از ثبت‌نام، بیمار اطلاعات و شرح حال خود را شامل ریپورت‌های پزشکی، پاتولوژی، عکس‌های رادیولوژی، علائم و غیره آپلود می‌کند.\n\nپس از آپلود مدارک، بیمار تاریخ و ساعت مناسب برای نوبت خود را انتخاب می‌کند.\n\nبه درگاه پرداخت هدایت شده و پس از پرداخت، تأییدیه نوبت به همراه لینک ویزیت آنلاین، تاریخ و ساعت دقیق از طریق پیامک برای او ارسال می‌شود.\n\nپنل کاربری پزشک:\n\nامکان مدیریت تقویم نوبت‌ها، ساعت‌های کاری و وضعیت‌های خالی/پر بودن.\n\nدسترسی به پروفایل بیمار، سوابق پزشکی و تاریخچه مشاوره‌های قبلی.\n\nمدیریت قیمت‌گذاری برای هر نوع مشاوره.\n\nپنل کاربری بیمار:\n\nمشاهده نوبت‌های رزرو شده و تاریخچه مشاوره‌های قبلی.\n\nپنل پرداخت امن (اتصال به درگاه‌های پرداخت ایرانی).\n\nسیستم هوش مصنوعی (AI) و پردازش داده:\n\nاطلاعات بیمار بلافاصله پس از ثبت، توسط هوش مصنوعی و بر اساس یک پرامپت (Prompt) مشخص تحلیل و خلاصه می‌شود.\n\nنتیجه تحلیل، شامل خلاصه‌سازی اطلاعات و تشخیص افتراقی (Differential Diagnosis)، به همراه یک ID اختصاصی در دیتابیس و پنل پزشک ذخیره می‌گردد.\n\nسیستم ارتباطی و ویزیت آنلاین:\n\nدر روز ویزیت، پزشک در پنل خود به اطلاعات پردازش‌شده توسط هوش مصنوعی و تمام مدارک بیمار دسترسی دارد.\n\nیک تماس تصویری یا صوتی آنلاین از طریق پلتفرم بین پزشک و بیمار برقرار می‌شود.\n\nپس از پایان ویزیت، پزشک می‌تواند یادداشت‌های خود را اضافه کند که به صورت خودکار در سیستم ثبت می‌شود و برای مراجعات بعدی در دسترس خواهد بود.\n\nمهارت‌های مورد نیاز:\nتخصص کامل و تجربه کافی در Bubble.io.\n\nآشنایی با طراحی UI/UX (رابط کاربری و تجربه کاربری) در Bubble.\n\nتجربه در پیاده‌سازی منطق‌های پیچیده (Workflows) در Bubble.\n\nتجربه کار با APIهای مرتبط برای اتصال به سرویس‌های هوش مصنوعی، درگاه پرداخت (زرین‌پال یا مشابه) و تماس تصویری.\n\nتجربه در مدیریت دیتابیس در Bubble.\n\nمحدوده زمانی و بودجه:\nلطفاً در پیشنهاد خود، یک تخمین از زمان مورد نیاز و هزینه پروژه را ارائه دهید.\n\nپروژه به صورت فازبندی شده پیش خواهد رفت و پس از توافق نهایی، فازهای دقیق‌تری تعریف خواهد شد.\n\nنکته: برای ما کیفیت و تخصص شما در Bubble بسیار مهم است. لطفاً در پیشنهاد خود، نمونه کارهای قبلی که با Bubble انجام داده‌اید را به همراه جزئیات پروژه و نقشی که در آن داشته‌اید، ذکر کنید.\n\nما منتظر دریافت پیشنهادات شما هستیم.",
      "timeline_days": 26,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 4500000,
      "max_budget": 17000000,
      "converted_min_budget_tomans": 9047009.91365526,
      "converted_max_budget_tomans": 34177593.0071421,
      "project_link": "https://ponisha.ir/project/646785"
    },
    {
      "id": "f2302a08-f873-4515-9716-740b2ee5934c",
      "title": "طراحی و پیاده‌سازی پلتفرم آنلاین نوبت دهی در حوزه سلامت",
      "date": "2025-03-13 21:54:51",
      "description": "عنوان: طراحی و پیاده‌سازی پلتفرم آنلاین نوبت دهی در حوزه سلامت\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: برنامه نویسی, برنامه نویسی تحت وب, طراحی تجربه کاربری (UX), طراحی رابط کاربری (UI), طراحی سایت\nمدت زمان پروژه: 50.0\nتوضیحات: ما به دنبال یک فرد متخصص یا یک تیم باتجربه و خلاق هستیم تا یک پلتفرم جامع آنلاین در حوزه سلامت طراحی و توسعه دهد. تمرکز اولیه پلتفرم بر ایجاد سیستم نوبت‌دهی هوشمند و کاربرپسند است که شامل دو بخش اصلی می‌شود:\n\n- پنل بیماران/کاربران:\nثبت‌نام و ورود ساده، امکان رزرو نوبت با تجربه کاربری روان و آسان.\n\n- پنل کلینیک‌ها:\nامکان درج و مدیریت وقت‌های آزاد جهت رزرو توسط بیماران.\n\nقابلیت‌ها و بخش‌های تکمیلی مورد نیاز:\n- وبلاگ برای بهبود سئو و تولید محتوا\n- امکان ثبت نظر، امتیازدهی و ارسال بازخورد سریع کاربران\n- رعایت استانداردهای بالای UI/UX\n- سیستم نوتیفیکیشن هوشمند (پیامکی و درون‌برنامه‌ای)\n- امکان گزارش‌دهی و آنالیز داده‌ها (داشبورد مدیریتی)\n- یکپارچگی با سیستم‌های جانبی HIS بیمارستانی و نرم‌افزارهای مطب‌ها\n- پروفایل جامع کاربران شامل ذخیره‌سازی سوابق پزشکی و امکان اشتراک‌گذاری\n- موتور جستجوی پیشرفته بین مراکز درمانی، خدمات و بازه‌های زمانی\n- پنل مدیریت قدرتمند و انعطاف‌پذیر جهت مدیریت کاربران و مراکز درمانی\n- سیستم پرداخت آنلاین امن (با اتصال به درگاه‌های پرداخت مختلف)\n- امکان رزرو نوبت اضطراری یا فوری\n- تأیید هویت کاربران جهت افزایش امنیت داده‌ها\n- امکان چت و پشتیبانی زنده\n- سیستم وفاداری (Loyalty Program) برای کاربران وفادار\n- امکان توسعه به‌صورت وب‌اپلیکیشن پیشرفته (PWA) برای دسترسی آسان کاربران از طریق موبایل\n\nشرایط همکاری:\nهمکاری می‌تواند به‌صورت فردی، تیمی، و یا تشکیل تیم اختصاصی (شامل Front-End، Back-End، UI/UX و Product Manager) باشد.\n\nاز پیشنهادات و ایده‌های نوآورانه و خلاقانه نیروهای متخصص جوان در جهت توسعه بهتر محصول استقبال می‌کنیم.\n\nاگر به معنای واقعی کلمه در خود توانایی همکاری با ما رو میبینید با آغوش باز پذیرای شما هستیم.",
      "timeline_days": 50,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 33500000,
      "max_budget": 50000000,
      "converted_min_budget_tomans": 68270571.07353179,
      "converted_max_budget_tomans": 101896374.73661461,
      "project_link": "https://ponisha.ir/project/583533"
    },
    {
      "id": "f3c3689a-2ab9-4a59-af6b-0692c052c7fb",
      "title": "سیستم نوبت دهی آنلاین",
      "date": "2015-06-13 16:16:17",
      "description": "عنوان: سیستم نوبت دهی آنلاین\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: MySQL, برنامه نویسی تحت وب, برنامه نویسی موبایل, پی اچ پی (PHP), سی اس اس (CSS)\nتوضیحات: <p>پروژه ما 2 قسمت داره</p>\n\n<p>قسمت اول - سیستمی نیاز دارم در اصل سایتی برای نوبت دهی آنلاین پزشکان  که باید ظاهری زیبا و رسپانسیو داشته یاشد</p>\n\n<p>به این صورت که اطلاعات پزشک و روز و ساعت های باقی مانده برای اخذ نوبت در آن قابل رویت باشد </p>\n\n<p>هر شخص پس از ورود به سایت میتواند رزرو خود را انجام دهد عضویت از طریق شناسه ی یکتا که کدملی شخص است صورت میگیرد . بدیهی است که همه ی این اطلاعات باید در پایگاه داده ثبت شود .</p>\n\n<p>پنل کاربری منشی پزشک و بیمار مجزا و منشی و پزشک امکان ثبت و یا حذف نوبت را دارا باشد</p>\n\n<p>تعداد ویزیت در هر ساعت قابل تغییر باشد </p>\n\n<p>امکان پرداخت حق ویزیت به صورت آنلاین امکان پذیر باشد </p>\n\n<p>امکان دریافت لیست نوبت ها برای منشی فراهم باشد</p>\n\n<p>قسمت دوم پروژه نرم افزار اندروید پزشک</p>\n\n<p>این نرم افزار قابلیت نوبت دهی درمطب را امکان پذیر میسازد که فرد با اجرای آن به سایت بیمارستان متصل می شود ابتدا در آن عضو می شود و بعد از ثبت نام و ورود به سایت  ، توضیحاتی کلی در مورد پزشک ، مشاهده گالری تصاویر پزشک ،اطلاع از خدمات پزشک و عملیات گرفتن نوبت ( درج در پایگاه داده ) حذف نوبت ( حذف از پایگاه داده ) و امکان پرداخت آنلاین حق ویزیت پس از انتخاب نوبت و قسمت مشاوره با پزشک نیز فعال باشد و همه ی این اطلاعات در پایان روز برای مدیر سایت ( اینکه چه کسانی نوبت گرفته اند و فعالیت سایت ) ارسال می شود .</p>\n\n<p>لطفا نمونه کار و دمو فراموش نشود</p>",
      "timeline_days": 0,
      "actual_price_tomans": 500000,
      "converted_price_tomans": 28601759.17500758,
      "min_budget": 250000,
      "max_budget": 750000,
      "converted_min_budget_tomans": 14300879.58750379,
      "converted_max_budget_tomans": 42902638.76251137,
      "project_link": "https://ponisha.ir/project/19358"
    },
    {
      "id": "1a483dca-96b8-41f2-b761-8a2989f5ea9d",
      "title": "طراحی وب سایت معاینه چشم و عینک",
      "date": "2025-04-21 20:17:40",
      "description": "عنوان: طراحی وب سایت معاینه چشم و عینک\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: طراحی رابط کاربری (UI), وردپرس (WordPress)\nمدت زمان پروژه: 32.0\nتوضیحات: ما به دنبال یک توسعه‌دهنده/تیم وردپرس با تجربه و متخصص هستیم برای طراحی و پیاده‌سازی یک وبسایت کاربردی و امن برای یک مرکز/مطب پزشکی. هدف اصلی سایت ارائه امکان نوبت‌دهی آنلاین به بیماران و همچنین ایجاد یک پنل داخلی برای پزشک جهت ثبت و مشاهده نسخه‌های بیماران است.\n\nقابلیت‌های مورد نیاز:\n\nسیستم نوبت‌دهی پیشرفته:\n\nامکان مشاهده زمان‌های خالی و رزرو نوبت توسط بیماران/مشتریان از طریق سایت.\nامکان ثبت و مدیریت نوبت‌ها (شامل لغو، تغییر و مشاهده جزئیات) توسط مدیر سایت یا پرسنل.\nقابلیت تعریف خدمات مختلف (مانند ویزیت، مشاوره و...).\nمدیریت تقویم زمان‌بندی، تعیین ساعات کاری، تعطیلات و زمان‌های استراحت.\nامکان ارسال پیامک یا ایمیل یادآوری و تایید نوبت برای بیماران و مدیر/پزشک (نیاز به امکان اتصال به پنل پیامک یا سرویس ایمیل).\n(اختیاری) امکان پرداخت آنلاین بخشی یا تمام هزینه ویزیت در زمان رزرو.\nسیستم مدیریت نسخ پزشکی:\n\nایجاد پنلی امن برای پزشک جهت ورود و ثبت جزئیات نسخه‌های بیماران (شامل اطلاعات بیمار، نام داروها، دوز، تاریخ، توضیحات و...).\nامکان مشاهده لیست نسخه‌های ثبت شده برای هر بیمار (توسط پزشک).\n(اختیاری) امکان دسترسی امن بیمار به نسخه‌های مربوط به خودش پس از ورود به حساب کاربری.\nتاکید بسیار مهم بر امنیت و حریم خصوصی داده‌های پزشکی در این بخش.\nمدیریت کاربران و سطوح دسترسی:\n\nتعریف نقش‌های کاربری مختلف (مانند مدیر سایت، پزشک، بیمار/مشتری).\nتعیین دقیق سطح دسترسی هر نقش به بخش‌های مختلف سایت (مثلاً پزشک فقط به بخش نوبت‌ها و نسخ خود دسترسی داشته باشد، بیمار فقط به نوبت‌ها و نسخه احتمالی خودش).\nساختار و طراحی:\n\nوبسایت باید بر پایه وردپرس پیاده‌سازی شود.\nطراحی ریسپانسیو (سازگار با موبایل و تبلت).\nرابط کاربری ساده، تمیز و کاربرپسند.\nمهارت‌ها و تجربه‌های مورد نیاز:\n\nتسلط کامل بر وردپرس، طراحی قالب و توسعه افزونه.\nتجربه کار با افزونه‌های قدرتمند و معتبر نوبت‌دهی وردپرس (مانند Amelia, Bookly یا موارد مشابه).\nتوانایی پیاده‌سازی قابلیت‌های سفارشی (Custom Post Types, Custom Fields) برای بخش مدیریت نسخ.\nآشنایی با مسائل امنیتی وردپرس و پیاده‌سازی راه‌کارهای حفظ حریم خصوصی داده‌ها.\nآشنایی با PHP, MySQL, HTML, CSS, JavaScript.\nارائه نمونه کارهای مرتبط (مخصوصاً در زمینه سایت‌های پزشکی یا سایت‌هایی با قابلیت‌های سفارشی).\nنحوه ارائه پیشنهاد:\n\nلطفاً در پیشنهاد خود موارد زیر را ذکر کنید:\n\nتجربه و سابقه کاری مرتبط خود را شرح دهید و نمونه کار ارائه دهید.\nرویکرد پیشنهادی خود را برای پیاده‌سازی سیستم مدیریت نسخ پزشکی توضیح دهید (آیا از افزونه خاصی استفاده می‌کنید یا نیاز به کدنویسی سفارشی است؟).\nافزونه نوبت‌دهی پیشنهادی شما چیست؟\nزمان‌بندی تقریبی پروژه را مشخص کنید.\nهزینه پیشنهادی خود را برای اجرای کل پروژه اعلام نمایید.\nمنتظر دریافت پیشنهادهای شما هستیم. لطفاً فقط در صورتی که تجربه و توانایی پیاده‌سازی تمامی قابلیت‌های ذکر شده (به خصوص قیمت مناسب) را دارید، پیشنهاد ارسال نمایید.",
      "timeline_days": 32,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 500000,
      "max_budget": 2000000,
      "converted_min_budget_tomans": 1163856.2767089896,
      "converted_max_budget_tomans": 4655425.1068359595,
      "project_link": "https://ponisha.ir/project/596266"
    },
    {
      "id": "ebf1f2d2-e738-4467-9e80-5bfbb3c7b759",
      "title": "طراحی سامانه تحت وب برای مدیریت فرآیندهای درمان و خسارت",
      "date": "2026-01-24 16:39:20",
      "description": "عنوان: طراحی سامانه تحت وب برای مدیریت فرآیندهای درمان و خسارت\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: برنامه نویسی, پایتون (Python), پی اچ پی (PHP), جاوا اسکریپت (JavaScript), طراحی وب واکنش‌گرا\nمدت زمان پروژه: 64.0\nتوضیحات: به یک تیم یا فرد متخصص برای طراحی یک سامانه تحت وب در حوزه خدمات درمانی نیاز داریم.\nتمرکز اصلی سامانه روی مدیریت چرخه زیر است :\n\n- ثبت و مدیریت اعضا و افراد تحت پوشش\n\n- ثبت درخواست‌های هزینه درمان (سرپایی و بستری)\n\n- بارگذاری و نگهداری مدارک و اسناد درمانی توسط کاربر یا اپراتور\n\n- گردش‌کار رسیدگی به پرونده‌ها (بررسی، تأیید / رد، ثبت توضیحات)\n\n- ثبت نتایج نهایی و آماده‌سازی اطلاعات برای پرداخت\n\n- امکان پیگیری وضعیت پرونده توسط کاربر از طریق پنل تحت وب\n\nسامانه حتماً باید تحت وب باشد و امکان توسعه و یکپارچگی با سیستم‌های دیگر در آینده را داشته باشد.\nاولویت با تیم‌ها یا افرادی است که قبلاً پروژه مشابه در حوزه درمان، بیمه درمان، خسارت یا مدیریت اسناد پزشکی انجام داده‌اند و دارای تجربه و نمونه کار قابل ارائه هستند.\n\nلطفاً در پیشنهاد خود فقط به‌صورت خلاصه موارد زیر را بنویسید:\n\n- نمونه کار یا تجربه‌های نزدیک به این موضوع\n\n- تکنولوژی‌های پیشنهادی\n\n- برآورد مالی و زمانی\n\nجزئیات کامل نیازمندی‌ها، فرآیندها و سناریوها پس از بررسی اولیه و از طریق پیام خصوصی توضیح داده خواهد شد.",
      "timeline_days": 64,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 100000000,
      "max_budget": 0,
      "converted_min_budget_tomans": 131641858.76070985,
      "converted_max_budget_tomans": 0,
      "project_link": "https://ponisha.ir/project/707485"
    },
    {
      "id": "f9ad7a5f-4969-4fd0-a1d9-d7696b8e97ae",
      "title": "سایت خدمات پزشکی",
      "date": "2025-11-10 10:30:59",
      "description": "عنوان: سایت خدمات پزشکی\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: برنامه نویسی تحت وب, جاوا اسکریپت (JavaScript), سی اس اس (CSS), طراحی رابط کاربری (UI)\nمدت زمان پروژه: 52.0\nتوضیحات: درود و وقت بخیر \n\nبه دنبال یک **پرتال حرفه‌ای و قابل توسعه با فریم‌ورک لاراول** هستم برای راه‌اندازی یک **سامانه جامع خدمات پزشکی**.\nپرتال باید امکانات زیر را داشته باشد (یا قابلیت افزودن آن‌ها در نسخه توسعه‌یافته وجود داشته باشد):\n\n* رزرو آنلاین نوبت پزشک با امکان تخصیص درصد برای طرفین\n* معرفی پزشکان متخصص و کلینیک‌ها\n* معرفی بیمارستان‌ها، درمانگاه‌ها و داروخانه‌ها\n* فروشگاه تجهیزات و لوازم پزشکی\n* بخش ویدیوهای آموزشی و معرفی پزشکان\n* امکان **مشاوره و ویدیوکال آنلاین**\n* سیستم تبلیغات و **فروش جایگاه‌های تبلیغاتی** پزشکان برتر در صفحه نخست* با اشتراک ماهانه و سالانه\n* بخش مقالات تخصصی\n* گالری نمونه‌کار پزشکان زیبایی\n\n🔹 **اولویت من خرید یک پرتال آماده‌ی مشابه و توسعه‌ی آن توسط شماست**، چون زمان برای اجرای پروژه محدود است.\nاگر پیش‌تر پروژه‌ای مشابه انجام داده‌اید یا دموی آماده در اختیار دارید، لطفاً در پیام اول ارسال کنید — قطعاً در اولویت انتخاب من خواهید بود.\n\nممنون از همکاری شما",
      "timeline_days": 52,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 1000000,
      "max_budget": 4000000,
      "converted_min_budget_tomans": 1750469.870292596,
      "converted_max_budget_tomans": 7001879.481170384,
      "project_link": "https://ponisha.ir/project/681299"
    },
    {
      "id": "6f4a763c-8d08-4df5-80d0-c3cf2de7813f",
      "title": "طراحی و ایجاد یک وبسایت نوبت دهی و مشاوره پزشکی",
      "date": "2025-09-15 15:16:43",
      "description": "عنوان: طراحی و ایجاد یک وبسایت نوبت دهی و مشاوره پزشکی\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: HTML, برنامه نویسی تحت وب, جاوا اسکریپت (JavaScript), سی اس اس (CSS), طراحی رابط کاربری (UI)\nمدت زمان پروژه: 10.0\nتوضیحات: **عنوان پروژه: طراحی و ایجاد یک وبسایت نوبت دهی و مشاوره پزشکی**\n\n**توضیحات پروژه:**\n\nبا سلام،\n\nما به دنبال طراحی و ایجاد یک وبسایت کامل برای نوبت دهی مطب پزشکان، مشاوره آنلاین و فروش دارو از داروخانه‌ها هستیم. وبسایت دارای ویژگی‌های به شرح زیر خواهد بود:\n\n1. **نوبت دهی آنلاین:** \n   - قابلیت ثبت نوبت برای پزشکان مختلف.\n\n2. **مشاوره آنلاین:**\n   - امکان مشاوره به صورت تلفنی و صوتی از طریق فناوری WebRTC.\n\n3. **فروش دارو و معرفی داروخانه‌ها:**\n   - معرفی داروخانه‌های شهرهای مختلف و امکان فروش محصولات آنها.\n\n4. **وبلاگ:**\n   - تولید محتوای بهینه‌سازی شده برای موتورهای جستجو (SEO).\n\n5. **پنل مدیریت:**\n   - پنل با امکانات کامل برای مدیریت نوبت‌ها و مشاوره‌ها.\n\n6. **درگاه پرداخت:**\n   - تسهیل فرآیند پرداخت برای کاربران.\n\n7. **هاست و دامنه:**\n   - لازم به ذکر است که هاست و دامنه از قبل تهیه شده‌اند.\n\nلطفاً پیشنهادات خود را در خصوص روش‌های اجرایی و نحوه انجام پروژه ارائه دهید. همچنین درخواست داریم که پیشنهادات فراتر از بودجه موجود ارائه نشود.\n\nبه همکار انتخاب شده، به عنوان پشتیبان فنی پروژه، فرصت‌های بیشتری برای پروژه‌های دیگر داده خواهد شد. \n\nدر صورتی که کم و کاستی در امکانات گفته شده وجود دارد لطفا با راهنمایی ها و پیشنهادات خود ما را در ایجاد یک پروژه موفق یاری نمایید.\nبا تشکر،  \n\n**دسته‌بندی پروژه: توسعه نرم‌افزار و آی‌تی**",
      "timeline_days": 10,
      "actual_price_tomans": 10000000,
      "converted_price_tomans": 19087378.395132013,
      "min_budget": 4500000,
      "max_budget": 17000000,
      "converted_min_budget_tomans": 8589320.277809406,
      "converted_max_budget_tomans": 32448543.271724418,
      "project_link": "https://ponisha.ir/project/657564"
    },
    {
      "id": "83ba9073-f819-44fd-8848-35061b648912",
      "title": "خدمات مشاوره درمانی آنلاین و غیرحضوری",
      "date": "2018-12-12 00:08:57",
      "description": "عنوان: خدمات مشاوره درمانی آنلاین و غیرحضوری\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: MySQL, برنامه نویسی تحت وب, پی اچ پی (PHP), سی اس اس (CSS)\nتوضیحات: <p>سلام.چیزی که ما از سایت درمانی مشاوره و نوبت دهی آنلاین یا  انتظار داریم: ‌</p><p>۱.قرار دادن عکس پزشکان ومعرفی و فیلم توضیح هرپزشک و...در مورد خودش  با طراحی خوب در سایت</p><p>۲.قرار دادن لینک پرداخت برای مشتریان.بدین صورت که بلافاصله بعداز پرداخت ،یه درصد مشخص به حساب مجموعه بیاد و بقیه بره به حساب پزشک مربوطه.</p><p>۳.قرار دادن قسمتی برای قرار دادن مطالب رایگان  سایت</p><p>۴.قرار دادن جایی برای اعلام نظرات</p><p>۵.قرار دادن پل های ارتباط با ما مثل اینستاگرام و تلگرام و واتساپ و شماره تماس و ایمیل.و گرفتن و جمع آوری اطلاعات مشتریان .</p><p>۶.تزیین و زیباسازی فضای سایت.</p><p>۷.سئو کردن سایت و قرار دادن سایت در سرچ اول گوگل</p><p>۸.پشتیبانی از سایت بعد از اتمام طراحی سایت</p><p>۹.قرار دادن و گرفتن نماداعتماد الکترونیک برای سایت</p><p>۱۰.یکسان بودن نمایش سایت در موبایل و کامپوتر و سرعت آپلود بالا.</p><p>۱۱.امکان ثبت مکالمات و ضبط همه چیز.امکان برقراری تلفنی از طریق سایت با کد پزشک مربوطه.</p><p>۱۲.امکان امتیازدهی و ثبت میانگین درصد رضایت مراجعین به هر پزشک</p><p>۱۳.برای درک بهتر لطفا به سایت drsaina.comمراجعه کنید.سایت مورد نظر بنده مشابه این سایت هست.</p>",
      "timeline_days": 0,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 1500000,
      "max_budget": 3000000,
      "converted_min_budget_tomans": 28389362.76969393,
      "converted_max_budget_tomans": 56778725.53938786,
      "project_link": "https://ponisha.ir/project/87753"
    },
    {
      "id": "e89d4f1e-3e03-40e0-9469-f45e768230ab",
      "title": "توسعه وب‌اپ پزشکی، پنل پزشک و بیمار،نوبت‌دهی و مشاوره آنلاین",
      "date": "2025-08-30 16:06:06",
      "description": "عنوان: توسعه وب‌اپ پزشکی، پنل پزشک و بیمار،نوبت‌دهی و مشاوره آنلاین\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: MySQL, Node.js, پی اچ پی (PHP), ری اکت (React), طراحی تجربه کاربری (UX)\nمدت زمان پروژه: 43.0\nتوضیحات: ما قصد داریم یک پلتفرم پزشکی آنلاین (وب‌اپلیکیشن) طراحی کنیم که در فاز اول امکانات زیر را داشته باشد:\n\t1.\tثبت‌نام و احراز هویت پزشکان (با مدارک پزشکی)\n\t2.\tپروفایل پزشک شامل: تخصص، سوابق، مقالات، ساعات حضور\n\t3.\tپنل بیمار شامل: ثبت‌نام، پروفایل شخصی، مشاهده پزشکان، گرفتن نوبت\n\t4.\tسیستم نوبت‌دهی آنلاین (زمان‌بندی ساده و قابل توسعه در آینده)\n\t5.\tمشاوره آنلاین درون پلتفرم (ارسال متن، ویس و مدارک توسط بیمار برای پزشک)\n\t6.\tداشبورد ادمین برای مدیریت پزشکان، بیماران، تراکنش‌ها و محتوا\n\t7.\tزیرساخت پرداخت آنلاین ریالی (درگاه زرین‌پال یا مشابه",
      "timeline_days": 43,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 17000000,
      "max_budget": 33500000,
      "converted_min_budget_tomans": 31620888.60397456,
      "converted_max_budget_tomans": 62311751.07253809,
      "project_link": "https://ponisha.ir/project/649836"
    },
    {
      "id": "f3e12ce0-c38d-484f-8a79-1137172a879d",
      "title": "طراحی سایت مشاوره آنلاین لحظه ای",
      "date": "2025-11-19 21:17:05",
      "description": "عنوان: طراحی سایت مشاوره آنلاین لحظه ای\nدسته‌بندی: توسعه‌ نرم‌افزار و آی‌تی\nکارفرما: Ponisha\nمهارت‌های موردنیاز: HTML, پی اچ پی (PHP), جاوا اسکریپت (JavaScript), سی اس اس (CSS), وردپرس (WordPress)\nمدت زمان پروژه: 24.0\nتوضیحات: عنوان پروژه: طراحی سایت مشاوره آنلاین لحظه‌ای\n\nتوضیحات پروژه:\n\nسلام و درود به همه فریلنسرهای عزیز،\n\nما به دنبال یک متخصص ماهر در طراحی وب‌سایت هستیم که توانایی ایجاد یک وب‌سایت مشاوره آنلاین مشابه سایت‌های ویزیت پزشکی آنلاین را داشته باشد. ویژگی‌های اصلی که در این پروژه مورد نظر است به شرح زیر می‌باشد:\n\n- قابلیت پرداخت آنلاین و برقراری تماس VoIP در لحظه پس از پرداخت\n- تخصص در استفاده از پلتفرم‌های وردپرس و ووکامرس\n- پیاده‌سازی سیستم رزرو آنلاین با استفاده از بوکلی\n- امکان چت آنلاین بین مشاور و مشتری\n- طراحی با رعایت استانداردهای UI/UX حرفه‌ای\n- بهینه‌سازی وب‌سایت برای نمایش در گوشی‌های همراه\n- ایجاد فرم ثبت‌نام برای کاربران\n- راه‌اندازی قسمت پرسش و پاسخ برای تسهیل تعاملات\n\nلطفاً اگر نمونه کارهای مشابهی در این زمینه دارید، به ما معرفی کنید. متقاضیان با تجربه در این حوزه در اولویت خواهند بود. \n\nلطفاً مدت زمان و هزینه پیشنهادی خود را ارسال نمایید.\n\nبا تشکر و آرزوی موفقیت برای همگی.  \nدسته‌بندی پروژه: توسعه نرم‌افزار و آی‌تی",
      "timeline_days": 24,
      "actual_price_tomans": 0,
      "converted_price_tomans": 0,
      "min_budget": 10000000,
      "max_budget": 40000000,
      "converted_min_budget_tomans": 16718376.030493751,
      "converted_max_budget_tomans": 66873504.121975005,
      "project_link": "https://ponisha.ir/project/685161"
    }
  ]
}

export async function ProcessDescRag(prompt: string) : Promise<ProjectPrediction> {

    // return mock;

    const result = await postFetch(
        APIURL + "extract_taxonomy_rag",
        JSON.stringify({
            "query": prompt
        })
    );



    const jsonResult = await result.json();

    if (result.ok) {
        toast.success("نتایج شما آماده است", {
        });
        return jsonResult;
    } else {
        // Handle different error status codes
        switch (result.status) {
            case 400:
                toast.error("خطای درخواست", {
                    description:
                        jsonResult.message || "مقدار ورودی نامعتبر است.",
                });
                break;
            case 401:
                toast.error("عدم احراز هویت", {
                    description: "مقدار ورودی اشتباه است.",
                });
                break;
            case 403:
                toast.error("مقدار ورودی اشتباه است", {
                    description: "لطفاً اطلاعات ورودی خود را بررسی کنید",
                });
                break;

            case 404:
                toast.error("api یافت نشد", {
                    description: "apiی با این مشخصات وجود ندارد.",
                });
                break;
            case 409:
                toast.error("حساب قفل شده", {
                    description: "حساب شما به دلیل تلاش‌های ناموفق متعدد قفل شده است.",
                });
                break;
            case 500:
                toast.error("خطای سرور", {
                    description: "خطایی در سرور رخ داده است. لطفاً بعداً تلاش کنید.",
                });
                break;
            default:
                toast.error("خطای ناشناخته", {
                    description:
                        jsonResult.error || "خطای نامشخصی در هنگام ورود رخ داده است.",
                });
        }
        throw new Error(jsonResult.error || "خطای نامشخص");
    }
}
